<?php

namespace App\Services;

use App\Entity\ShopCategory;
use Doctrine\ORM\EntityManagerInterface;
use Fisharebest\Algorithm\Dijkstra;

class RouteService
{
    public function __construct(
        protected EntityManagerInterface $em
    ) {
    }

    public function getRoute(): array
    {
        $paths = (new Dijkstra($this->getGraph()))->shortestPaths('A Бакалея', 'L Косметика / гигиена');
        $path = $paths[0];

        $path = array_map(function($item) {
            return substr($item, 2);
        }, $path);

        return $this->em->getRepository(ShopCategory::class)->getShopToCoordinatesByPath($path);
    }

    protected function getGraph(): array
    {
        return [
            'A Бакалея' => [
                'B Соки и воды' => 2,
                'E Молочные продукты' => 1,
            ],
            'B Соки и воды' => [
                'A Бакалея' => 1,
                'C Мясо и колбасы' => 1,
                'F Детские товары' => 1,
            ],
            'C Мясо и колбасы' => [
                'B Соки и воды' => 1,
                'D Рыба и морепродукты' => 1,
                'G Детские игрушки' => 1,
            ],
            'D Рыба и морепродукты' => [
                'C Мясо и колбасы' => 1,
                'H Товары для животных' => 1,
            ],
            'E Молочные продукты' => [
                'A Бакалея' => 1,
                'F Детские товары' => 1,
                'I Кондитерские изделия' => 1,
            ],
            'F Детские товары' => [
                'E Молочные продукты' => 1,
                'B Соки и воды' => 1,
                'G Детские игрушки' => 1,
                'J Хозяйственные товары' => 1,
            ],
            'G Детские игрушки' => [
                'F Детские товары' => 1,
                'C Мясо и колбасы' => 1,
                'H Товары для животных' => 1,
                'K Полуфабрикаты' => 1,
            ],
            'H Товары для животных' => [
                'D Рыба и морепродукты' => 1,
                'G Детские игрушки' => 1,
                'L Косметика / гигиена' => 1,
            ],
            'I Кондитерские изделия' => [
                'E Молочные продукты' => 1,
                'J Хозяйственные товары' => 1,
            ],
            'J Хозяйственные товары' => [
                'I Кондитерские изделия' => 1,
                'F Детские товары' => 1,
                'K Полуфабрикаты' => 1,
            ],
            'K Полуфабрикаты' => [
                'G Детские игрушки' => 1,
                'J Хозяйственные товары' => 1,
                'L Косметика / гигиена' => 1,
            ],
            'L Косметика / гигиена' => [
                'K Полуфабрикаты' => 1,
                'H Товары для животных' => 1,
            ],
            'M Посуда' => [
                'I Кондитерские изделия' => 1,
                'N Детское питание' => 1,
            ],
            'N Детское питание' => [
                'M Посуда' => 1,
                'J Хозяйственные товары' => 1,
                'O Товары для дома' => 1,
            ],
            'O Товары для дома' => [
                'N Детское питание' => 1,
                'K Полуфабрикаты' => 1,
                'P Автотовары' => 1,
            ],
            'P Автотовары' => [
                'O Товары для дома' => 1,
                'L Косметика / гигиена' => 1,
            ],
            'Q Сезонные товары' => [],
            'R Одежда' => [],
        ];
    }
}