<?php

        $catalog = [
            'Овощи, фрукты, грибы, зелень, ягоды' => [
                'Фрукты' => [
                    'Авокадо',
                    'Ананас',
                    'Апельсин',
                    'Арбуз',
                    'Банан',
                    'Виноград',
                    'Гранат',
                    'Грейпфрут, помело',
                    'Груша',
                    'Дыня',
                    'Киви',
                    'Лимон, лайм',
                    'Манго',
                    'Мандарин',
                    'Слива',
                    'Яблоко',
                    'Хурма',
                    'Экзотические фрукты',
                ],
                'Ягоды' => [
                    'Ягоды',
                ],
                'Овощи' => [
                    'Баклажаны',
                    'Кабачки',
                    'Капуста',
                    'Картофель',
                    'Кукуруза',
                    'Лук, чеснок',
                    'Морковь',
                    'Огурцы',
                    'Перец',
                    'Редис, редька, репа',
                    'Свекла',
                    'Сельдерей',
                    'Томаты',
                    'Тыква',
                    'Экзотические овощи',
                ],
                'Грибы' => [
                    'Экзотические грибы',
                    'Шампиньоны, вешенки',
                    'Сушеные грибы',
                ],
                'Зелень' => [
                    'Микрозелень',
                    'Петрушка',
                    'Укроп',
                    'Лук зеленый',
                    'Наборы зелени',
                    'Прочая зелень',
                ],
                'Салаты, салатные смеси' => [
                    'Салатные смеси',
                    'Салаты',
                ],
            ],
        ];

        $catalog = [
            'Молочные продукты, сыр, яйца' => [
                'Молоко' => [
                    'Молоко',
                    'Молоко сгущенное',
                    'Детское молоко',
                    'Козье молоко',
                    'Ультрапастеризованное молоко',
                    'Топленое молоко',
                    'Сухое молоко',
                    'Кокосовое молоко',
                    'Миндальное молоко',
                    'Овсяное молоко',
                    'Рисовое молоко',
                    'Соевое молоко',
                    'Прочее растительное молоко',
                ],
                'Кефир, кисломолочные напитки' => [
                    'Кефир',
                    'Кисломолочные напитки, закваски',
                ],
                'Сыры' => [
                    'Сыры сычужные твердые, полутвердые',
                    'Сыры рассольные, мягкие',
                    'Сыры с плесенью',
                    'Сыры плавленые',
                    'Сыры творожные',
                    'Сыры колбасные, копченые',
                ],
                'Йогурт' => [
                    'Детские йогурты',
                    'Детский йогурт питьевой',
                    'Йогурт',
                    'Йогурт питьевой',
                ],
                'Масло сливочное, маргарин' => [
                    'Масло сливочное',
                    'Маргарин, спреды',
                    'Масло топленое',
                ],
                'Сметана, сливки' => [
                    'Сметана',
                    'Сливки',
                ],
                'Творог, творожные изделия' => [
                    'Детский творог',
                    'Творог',
                    'Сырки глазированные, творожные, пирожные',
                    'Десерты, кремы творожные',
                ],
                'Молочные коктейли, пудинги' => [
                    'Детские коктейли',
                    'Пудинги, желе',
                    'Молочные напитки, коктейли',
                ],
                'Яйцо куриное, перепелиное' => [
                    'Яйцо куриное',
                    'Яйцо перепелиное',
                ],
                'Мороженое' => [
                    'Порционное',
                    'Большие порции',
                    'На большую компанию',
                    'Фруктовый лед',
                ],
                'Безлактозные молочные продукты' => [
                    'Молоко',
                    'Сливки',
                    'Сыр',
                    'Прочие безлактозные продукты',
                ],
            ],
        ];

        $catalog = [
            'Мясо, птица, мясная гастрономия' => [
                'Мясо' => [
                    'Свинина',
                    'Говядина',
                    'Баранина',
                    'Кролик',
                ],
                'Птица' => [
                    'Куры, цыплята',
                    'Индейка, утка',
                ],
                'Полуфабрикаты, фарши, колбаски' => [
                    'Фарши',
                    'Колбаски',
                    'Шашлык',
                    'Котлеты, голубцы',
                    'Готово для запекания',
                ],
                'Колбасные изделия' => [
                    'Колбаса варено-копченые',
                    'Колбаса, ветчина вареная',
                    'Колбаса сырокопченая, сыровяленая',
                    'Сосиски, сардельки',
                    'Мясные, колбасные снэки',
                ],
                'Мясные изделия' => [
                    'Копчено-вареные, копчено-запеченные',
                    'Сыровяленые, соленые',
                    'Сырокопченые',
                ],
                'Паштеты, консервы' => [
                    'Паштеты, намазки, студень',
                    'Консервы мясные',
                ],
                'Green Kitchen' => [
                    'Готовые изделия',
                ],
                'Субпродукты' => [
                    'Субпродукты',
                ],
            ],
        ];

        $catalog = [
            'Рыба, икра, морепродукты' => [
                'Икра' => [
                    'Икра натуральная',
                    'Икра имитированная',
                ],
                'Рыбные пресервы, консервы, закуски' => [
                    'Капуста морская',
                    'Рыбные закуски',
                    'Рыбные пресервы',
                    'Рыбные консервы',
                    'Крабовые палочки охлажденные',
                ],
                'Рыба' => [
                    'Рыбные стейки и филе свежемороженые',
                    'Рыба свежемороженая',
                    'Рыба охлажденная',
                    'Рыба соленая',
                    'Рыба копченая',
                    'Рыбные снеки, рыба вяленая, сушеная',
                ],
                'Замороженные рыбные продукты' => [
                    'Морепродукты',
                    'Рыбные полуфабрикаты',
                    'Крабовые палочки',
                ],
            ],
        ];

        $catalog = [
            'Товары для детей и мам' => [
                'Детское питание' => [
                    'Каши',
                    'Молочные смеси',
                    'Пюре мясное',
                    'Пюре овощное, плодоовощное',
                    'Пюре фруктовое',
                    'Пюре рыбное',
                    'Чай, какао',
                    'Соки, напитки',
                    'Вода',
                    'Птица и мясосодержащая продукция',
                    'Печенье, батончики',
                    'Конфеты',
                ],
                'Детская молочная продукция' => [
                    'Йогурт',
                    'Молоко, кефир',
                    'Творог',
                    'Коктейли',
                    'Каши, смеси готовые',
                ],
                'Гигиена, уход, аксессуары' => [
                    'Детские зубные пасты, щетки',
                    'Детские шампуни',
                    'Детский крем',
                    'Косметическое масло для детей',
                    'Средства для купания, детское мыло',
                    'Подгузники размер 0-1',
                    'Подгузники размер 2',
                    'Подгузники размер 3',
                    'Подгузники размер 4',
                    'Подгузники размер 5',
                    'Подгузники размер 6-7',
                    'Пеленки одноразовые',
                    'Присыпки',
                    'Влажные салфетки',
                    'Соски, пустышки, бутылочки',
                    'Аксессуары для малышей и мам',
                ],
                'Средства для ухода за детскими вещами' => [
                    'Средства для мытья посуды',
                    'Средства для стирки',
                ],
                'Игрушки, творчество, развлечения' => [
                    'Детская литература, раскраски',
                    'Настольные игры, пазлы, конструкторы',
                    'Мягкие игрушки',
                    'Творчество',
                    'Игрушки для самых маленьких',
                    'Игрушки для девочек',
                    'Игрушки для мальчиков',
                    'Сезонные игрушки',
                ],
                'Одежда' => [
                    'Носки',
                    'Колготки',
                    'Шапки, шарфы, перчатки',
                ],
            ],
        ];

        $catalog = [
            'Вода, соки, напитки' => [
                'Вода' => [
                    'Вода минеральная',
                    'Вода питьевая негазированная',
                    'Вода питьевая газированная',
                    'Вода детская',
                ],
                'Соки, нектары, морсы' => [
                    'Соки',
                    'Нектары, морсы',
                    'Соки, нектары детские',
                ],
                'Напитки' => [
                    'Газированные напитки, квас',
                    'Безалкогольные вина',
                    'Негазированные, сокосодержащие напитки',
                    'Энергетические напитки',
                ],
            ],
        ];

        $catalog = [
            'Хлебобулочные, кондитерские изделия' => [
                'Хлеб, батон' => [
                    'Хлеб, тостовый хлеб',
                    'Батон, чиабатта, багет',
                    'Лаваш, тортилья',
                    'Булочки для хот-догов, гамбургеров',
                ],
                'Торты, пирожные' => [
                    'Торты',
                    'Пирожные',
                ],
                'Конфеты, шоколад, пасты' => [
                    'Конфеты шоколадные',
                    'Карамель, леденцы',
                    'Наборы конфет',
                    'Шоколад',
                    'Шоколадные батончики',
                    'Шоколадная, арахисовая паста',
                ],
                'Печенье, вафли, пряники' => [
                    'Вафли',
                    'Печенье',
                    'Пряники, коржи',
                    'Крекеры',
                    'Овсяное печенье',
                    'Печенье в больших упаковках',
                    'Печенье-сэндвич',
                ],
                'Восточные сладости' => [
                    'Зефир, пастила, рахат-лукум',
                    'Козинаки',
                    'Мармелад',
                    'Халва, щербет',
                ],
                'Выпечка, мучные сладости' => [
                    'Булочки, кексы',
                    'Круассаны, бисквитные сладости',
                    'Сладости мучные',
                ],
                'Сухари, сушки, тарталетки, палочки' => [
                    'Тарталетки, сухари панировочные',
                    'Сухари, сушки, баранки',
                    'Палочки соленые, сладкие',
                ],
                'Жевательные резинки, драже, конфеты' => [
                    'Жевательные резинки',
                    'Драже, конфеты освежающие, мармелад',
                ],
            ],
        ];

        $catalog = [
            'Бакалея' => [
                'Макаронные изделия' => [
                    'Спагетти, гнезда, лапша',
                    'Лазанья, каннеллони',
                    'Рожки, перья, прочие',
                ],
                'Масло растительное' => [
                    'Масло оливковое',
                    'Масло подсолнечное',
                    'Масло прочее',
                ],
                'Орехи, сухофрукты, семечки' => [
                    'Орехи',
                    'Семечки, прочие семена',
                    'Сухофрукты, смеси орехов и сухофруктов',
                ],
                'Крупы, бобовые' => [
                    'Крупа гречневая',
                    'Рис',
                    'Крупа манная',
                    'Крупа перловая, ячменная, пшеничная',
                    'Овес, полба, рожь, семена',
                    'Прочие крупы',
                    'Фасоль, горох, чечевица, нут',
                ],
                'Сахар, соль' => [
                    'Сахар',
                    'Заменитель сахара',
                    'Соль',
                ],
                'Приправы, кондитерские добавки' => [
                    'Моно специи',
                    'Смеси, специи',
                    'Бульоны, смеси для приготовления',
                    'Кондитерские добавки',
                ],
                'Мука, смеси для выпечки' => [
                    'Мука пшеничная',
                    'Мука кукурузная, рисовая, гречневая',
                    'Мука прочая',
                    'Смеси для выпечки',
                ],
                'Кетчуп, майонез, соусы, горчица, хрен' => [
                    'Кетчуп, соус томатный',
                    'Майонез, соус майонезный',
                    'Соевый соус',
                    'Соус терияки, кунжутный',
                    'Соус песто',
                    'Соус фруктовый, ягодный',
                    'Горчица, аджика',
                    'Хрен',
                    'Соусы прочие',
                ],
                'Овощная консервация' => [
                    'Горошек',
                    'Кукуруза',
                    'Оливки, маслины',
                    'Каперсы',
                    'Грибы',
                    'Огурцы',
                    'Томаты',
                    'Перец',
                    'Фасоль',
                    'Прочая консервация',
                ],
                'Консервация мясная и рыбная' => [
                    'Мясная консервация',
                    'Паштеты',
                    'Рыбная консервация',
                ],
                'Варенье, джемы, мед, сиропы, фруктовая консервация' => [
                    'Варенье',
                    'Джемы, фруктовые пюре',
                    'Мед',
                    'Сиропы, топпинги',
                    'Фруктовая консервация',
                ],
                'Квашения, соления, салаты, прочие закуски' => [
                    'Капуста квашеная, маринованная',
                    'Морковь по-корейски',
                    'Огурцы, томаты, чеснок',
                    'Салаты, закуски',
                    'Свекла, картофель для драников',
                ],
                'Чипсы, снеки, сухарики' => [
                    'Чипсы, снеки',
                    'Сухарики',
                    'Снеки рыбные, мясные',
                ],
                'Этническая кухня и аксессуары' => [
                    'Аксессуары',
                    'Водоросли морские, рисовая бумага',
                    'Имбирь маринованный, васаби',
                    'Лапша, вермишель, фунчоза',
                    'Соусы, уксус',
                    'Молоко кокосовое, масло, сливки',
                ],
                'Хлопья, каши, сухие завтраки, кукурузные палочки' => [
                    'Мюсли, прочие сухие завтраки',
                    'Хлопья, каши',
                    'Кукурузные палочки, попкорн, сладкая вата',
                ],
                'Сода, уксус, дрожжи, желатин, крахмал, супы' => [
                    'Уксус, сода',
                    'Желатин, крахмал, дрожжи',
                    'Супы',
                ],
                'Быстрое питание' => [
                    'Лапша',
                    'Вермишель',
                    'Пюре, каша, суп',
                ],
            ],
        ];

        $catalog = [
            'Здоровое питание' => [
                'Батончики, гранола' => [
                    'Батончики, батончики-мюсли',
                    'Мюсли, гранола',
                ],
                'Вегетарианские и веганские продукты' => [
                    'Кокосовое молоко, сливки, масло',
                    'Соевое молоко, сливки, прочие напитки',
                    'Соевая продукция, тофу, сыр',
                    'Супы, пюре, смеси для приготовления супов и гарниров',
                    'Хумус',
                    'Колбасы, паштеты',
                    'Бургеры, котлеты, фарш',
                    'Десерты',
                    'Соусы, майонезы',
                ],
                'Диетическое и диабетическое питание' => [
                    'Bio товары',
                    'Продукты без глютена',
                    'Спортивное питание',
                    'Заменитель сахара',
                    'Клетчатка, отруби',
                    'Конфеты, шоколад',
                    'Паста, урбеч',
                    'Пастила',
                    'Пюре, смузи',
                    'Восточные сладости',
                    'Вафли, печенье',
                    'Мороженое',
                    'Джемы',
                ],
                'Диетические напитки' => [
                    'Цикорий',
                    'Кисель',
                    'Прочие напитки',
                ],
                'Каши, хлопья, мука' => [
                    'Каши, лен, семена',
                    'Мука',
                ],
                'Хлебцы, чипсы фруктовые' => [
                    'Снеки, чипсы',
                    'Хлебцы',
                ],
            ],
        ];

        $catalog = [
            'Кофе, чай, какао' => [
                'Кофе' => [
                    'Кофе в зернах',
                    'Кофе в капсулах',
                    'Кофе молотый',
                    'Кофе растворимый',
                ],
                'Чай и чайные напитки' => [
                    'Чай черный листовой',
                    'Чай черный пакетированный',
                    'Чай зеленый листовой',
                    'Чай зеленый пакетированный',
                    'Чай фруктовый, травяной листовой',
                    'Чай фруктовый, травяной пакетированный',
                ],
                'Какао, горячий шоколад' => [
                    'Какао, какао порошок',
                ],
            ],
        ];

        $catalog = [
            'Замороженные продукты' => [
                'Пельмени, клецки, манты' => [
                    'Пельмени, гиоза',
                    'Клецки, манты, хинкали',
                ],
                'Блинчики, вареники, равиоли' => [
                    'Блинчики',
                    'Вареники, равиоли',
                ],
                'Готовые и полуготовые блюда' => [
                    'Наггетсы, котлеты, тефтели',
                    'Полуфабрикаты быстрого приготовления',
                ],
                'Овощи, грибы' => [
                    'Овощи, овощные смеси',
                    'Картофель, картофельные оладьи',
                    'Грибы',
                ],
                'Ягоды' => [
                    'Ягоды',
                ],
                'Пиццы, тесто' => [
                    'Пицца, основа для пиццы',
                    'Тесто',
                ],
                'Рыба, рыбные полуфабрикаты' => [
                    'Морепродукты',
                    'Рыбные стейки и филе свежемороженые',
                    'Рыба свежемороженая',
                    'Рыбные полуфабрикаты',
                ],
            ],
        ];

        $catalog = [
            'Товары для дома' => [
                'Эко бытовая химия' => [
                    'Эко бытовая химия',
                ],
                'Бытовая химия' => [
                    'Гели, капсулы для стирки',
                    'Стиральные порошки, мыло хозяйственное',
                    'Кондиционеры для белья',
                    'Отбеливатели, пятновыводители',
                    'Для мытья посуды',
                    'Для удаления накипи, смягчения воды',
                    'Для уборки помещений',
                    'Освежители воздуха',
                    'Для ванны, туалета, труб',
                    'Для мытья окон',
                    'Для мебели, полов, стен',
                ],
                'Товары для кухни' => [
                    'Фольга, пергамент для выпечки, пленка, пакеты',
                    'Бумажные полотенца, салфетки',
                    'Посуда, приборы для приготовления, хранения пищи',
                    'Столовая посуда, приборы',
                    'Хозяйственные принадлежности',
                    'Термопосуда',
                    'Фильтры для воды',
                ],
                'Товары для уборки' => [
                    'Губки, салфетки',
                    'Пакеты для мусора',
                    'Перчатки хозяйственные',
                    'Швабры, мопы',
                ],
                'Аксессуары и средства по уходу за одеждой и обувью' => [
                    'Предметы и средства для ухода за одеждой',
                    'Аксессуары и средства для ухода за обувью',
                ],
                'Элементы питания, лампы, клей, сумки, мешочки' => [
                    'Батарейки',
                    'Лампочки',
                    'Клей',
                    'Сумки, мешочки',
                ],
                'Свечи, ароматизаторы, декор' => [
                    'Свечи, подсвечники, декор',
                    'Ароматизаторы',
                ],
                'Домашний текстиль' => [
                    'Домашний текстиль, постельное белье',
                ],
                'Хозяйственные принадлежности, бытовые, электробытовые товары' => [
                    'Хозяйственные принадлежности',
                    'Компьютерные и мобильные аксессуары',
                    'Бытовая техника',
                    'Средства, инструменты для ремонта',
                ],
            ],
        ];

        $catalog = [
            'Косметика, гигиена, уход' => [
                'Антисептические, защитные средства' => [
                    'Гели, спреи, мыло',
                    'Влажные салфетки',
                    'Защитные маски',
                ],
                'Эко косметика' => [
                    'Эко косметика',
                ],
                'Бумажная гигиена' => [
                    'Туалетная бумага',
                    'Бумажные полотенца',
                    'Бумажные платочки',
                ],
                'Ватная продукция, влажные салфетки' => [
                    'Ватные диски',
                    'Ватные палочки',
                    'Влажные салфетки',
                ],
                'Женская гигиена' => [
                    'Прокладки',
                    'Тампоны',
                ],
                'Средства для интимной гигиены, контрацепция' => [
                    'Контрацепция, тесты на беременность',
                    'Средства для интимной гигиены',
                ],
                'Уход за волосами' => [
                    'Шампуни женские',
                    'Шампуни мужские',
                    'Шампуни детские',
                    'Бальзамы, маски для волос',
                    'Средства для укладки',
                    'Средства для окрашивания волос',
                ],
                'Уход за полостью рта' => [
                    'Зубные пасты',
                    'Зубные щетки',
                    'Ополаскиватели для полости рта',
                    'Зубная нить',
                ],
                'Уход за лицом' => [
                    'Средства для и после бритья',
                    'Принадлежности для бритья',
                    'Декоративная косметика',
                    'Средства по уходу за кожей',
                    'Средства для очищения кожи',
                ],
                'Уход за телом' => [
                    'Гели для душа и скрабы для тела',
                    'Туалетное мыло',
                    'Дезодоранты женские',
                    'Дезодоранты мужские',
                    'Лосьоны и кремы для тела',
                    'Пена, соль для ванны',
                    'Мочалки, массажеры для тела',
                    'Средства для бритья и депиляции',
                    'Принадлежности для бритья',
                    'Средства для ухода за руками и ногами',
                    'Средства для маникюра и педикюра',
                    'Средства для и после загара',
                ],
                'Подарочные наборы' => [
                    'Подарочные наборы женские',
                    'Подарочные наборы мужские',
                ],
                'Аксессуары' => [
                    'Расчески, зеркала, массажеры',
                ],
                'Подгузники, пеленки для взрослых' => [
                    'Подгузники, пеленки для взрослых',
                ],
            ],
        ];

        $catalog = [
            'Зоотовары' => [
                'Корма, лакомства, миски' => [
                    'Корма для собак',
                    'Корма для кошек',
                    'Корма для птиц, рыбок, грызунов',
                    'Миски',
                    'Лакомства для собак',
                    'Лакомства для кошек',
                ],
                'Аксессуары, наполнители, игрушки' => [
                    'Наполнители, пеленки, лотки',
                    'Игрушки',
                ],
                'Уход' => [
                    'Средства для ухода',
                    'Предметы для ухода',
                ],
            ],
        ];

        $catalog = [
            'Канцелярские товары' => [
                'Письменные принадлежности' => [
                    'Ручки',
                    'Карандаши',
                ],
                'Тетради, дневники, блокноты, календари' => [
                    'Тетради, дневники',
                    'Блокноты, ежедневники',
                    'Бумага для заметок, стикеры',
                ],
                'Школьные принадлежности' => [
                    'Точилки, ластики, линейки, циркули',
                    'Пеналы, папки',
                    'Обложки для тетрадей, книг',
                    'Клей, корректор, ножницы, скотч',
                ],
                'Товары для творчества' => [
                    'Краски, кисточки',
                    'Пластилин, тесто',
                    'Карандаши, фломастеры, мелки цветные',
                    'Цветная бумага, картон, альбомы',
                ],
                'Сувенирная продукция' => [
                    'Сувенирная продукция',
                ],
                'Товары для праздника' => [
                    'Шары, свечи',
                ],
                'Литература' => [
                    'Литература',
                ],
            ],
        ];

        $catalog = [
            'Автотовары' => [
                'Аксессуары для авто' => [
                    'Ароматизаторы',
                    'Аксессуары для автоэлектроники',
                    'Щетки, скребки',
                ],
                'Автокосметика' => [
                    'Очиститель, шампунь, полироль',
                ],
                'Автомобильная химия' => [
                    'Стеклоомыватель, смазка, прочая автохимия',
                    'Моторное масло, антифриз, тормозная жидкость',
                ],
            ],
        ];

        $catalog = [
            'Сад, огород' => [
                'Семена, саженцы' => [
                    'Микрозелень',
                    'Семена овощей',
                    'Семена зелени, салатов',
                    'Семена цветов',
                    'Семена фруктов, ягод',
                ],
                'Садовый инвентарь' => [
                    'Садовый инвентарь',
                ],
                'Почвогрунт, дренаж, удобрения' => [
                    'Почвогрунт',
                    'Удобрения',
                    'Дренаж',
                ],
                'Аксессуары для комнатных растений' => [
                    'Цветочные горшки, вазы',
                ],
            ],
        ];

        $catalog = [
            'Товары для спорта и отдыха' => [
                'Товары для отдыха' => [
                    'Товары для гриля',
                    'Одноразовая посуда',
                    'Инвентарь для отдыха',
                    'Средства для борьбы с насекомыми',
                    'Средства для и после загара',
                    'Термопосуда',
                ],
                'Товары для спорта и фитнеса' => [
                    'Товары для плавания',
                    'Активный спорт',
                    'Эспандеры',
                    'Мячи спортивные и сопутствующий инвентарь',
                    'Коврики',
                    'Гантели',
                    'Бутылки для воды',
                    'Скакалки',
                    'Йога, массаж, фитнес',
                ],
            ],
        ];

        $catalog = [
            'Одежда' => [
                'Чулочно-носочные изделия' => [
                    'Носки, гольфы женские',
                    'Носки мужские',
                    'Носки детские',
                    'Колготки, чулки женские',
                    'Колготки детские',
                ],
                'Обувь' => [
                    'Женская обувь',
                    'Мужская обувь',
                    'Детская обувь',
                ],
            ],
        ];

        $catalog = [
            'Подарочные сертификаты' => [
                'Подарочные сертификаты' => [
                    'Подарочные сертификаты',
                ],
            ],
        ];